app/views/layouts/_top_nav.html.erb

SELECT "categories".* FROM "categories"
---
          <ul class="dropdown-menu">
            <% Category.all.each do |category| %>